tap "barutsrb/tap", trusted: true
tap "can1357/tap"
tap "domt4/autoupdate", "https://github.com/DomT4/homebrew-autoupdate.git", trusted: true
tap "nikitabobko/tap", trusted: true
tap "tw93/tap", trusted: true
# Simple, modern, secure file encryption
brew "age"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# Cross-platform make
brew "cmake"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# LLVM's OpenMP runtime library
brew "libomp"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Painless compression and decompression for your terminal
brew "pnpm"
# Quick and easy command-line file transfer utility from any computer to another
brew "portal"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Coding agent with the IDE wired in
brew "can1357/tap/omp", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Agent orchestration platform
cask "antigravity"
# Web browser focusing on privacy
cask "brave-browser"
# Time tracking tool for agencies and freelancers
cask "font-jetbrains-mono"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Tiling window manager for macOS with Niri-inspired column-based layout
cask "barutsrb/tap/omniwm", trusted: true
# Replacement for Docker Desktop
cask "orbstack"
# Client for Proton Drive
cask "raycast"
# Real time file synchronisation software
cask "syncthing-app"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zap"
cask "zed"
vscode "commandcode.commandcode-vscode"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "hiteshchoudharycode.chai-theme"
vscode "kubescape.kubescape"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rishitmohanty3.leetcode-dark"
vscode "tal7aouy.rainbow-bracket"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "vizards.deepseek-v4-for-copilot"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
npm "command-code"
npm "eslint"
npm "tree-sitter-cli"
